tap "ariga/tap"
tap "bufbuild/buf"
tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "filosottile/musl-cross"
tap "homebrew/bundle"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "ringohub/redis-cli"
tap "thezoraiz/ascii-image-converter"
brew "libpng"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "glib"
brew "harfbuzz"
brew "bazel"
brew "bear"
brew "ccls"
brew "clipboard"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "croc"
brew "csvkit"
brew "dmg2img"
brew "dolt"
brew "gflags"
brew "glog"
brew "folly"
brew "fizz"
brew "wangle"
brew "fb303"
brew "edencommon"
brew "unbound"
brew "gnutls"
brew "emacs", link: false
brew "libtool"
brew "erlang"
brew "exiftool"
brew "expect"
brew "fd"
brew "libass"
brew "librist"
brew "libvpx"
brew "pango"
brew "tesseract"
brew "x265"
brew "ffmpeg"
brew "gcc"
brew "pmix"
brew "open-mpi"
brew "figlet"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "gitleaks"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go@1.21"
brew "pkgconf"
brew "gobject-introspection"
brew "gpatch"
brew "gpgme"
brew "librsvg"
brew "graphviz"
brew "grpc"
brew "grpcui"
brew "grpcurl"
brew "guile"
brew "hadolint"
brew "hdf5"
brew "htop"
brew "hugo"
brew "hydra"
brew "iftop"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "ispell"
brew "jemalloc"
brew "jmeter"
brew "jpeg", link: true
brew "jq"
brew "node"
brew "pandoc"
brew "jupyterlab"
brew "kind"
brew "lazygit"
brew "libfido2"
brew "libiconv"
brew "libimobiledevice"
brew "libmatio"
brew "libpano"
brew "libpq", link: true
brew "librdkafka"
brew "libvterm"
brew "libxslt"
brew "lolcat"
brew "lrzsz"
brew "lsd"
brew "lua-language-server"
brew "lua@5.3"
brew "luarocks"
brew "markdown"
brew "maven"
brew "md2pdf"
brew "md5deep"
brew "mercurial"
brew "miller"
brew "minikube"
brew "mole"
brew "mongo-c-driver"
brew "mongosh"
brew "mtr"
brew "protobuf"
brew "mysql"
brew "neovim"
brew "neovim-remote"
brew "nghttp2"
brew "nmap"
brew "openjdk@17"
brew "openssl@1.1"
brew "openvino"
brew "perl"
brew "pipenv"
brew "pipx"
brew "plantuml"
brew "pngcheck"
brew "pngpaste"
brew "poppler"
brew "protobuf@21"
brew "protobuf@29", link: true
brew "swift-protobuf"
brew "protoc-gen-grpc-swift"
brew "pyenv"
brew "qt"
brew "pyqt"
brew "python@3.8"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "rich-cli"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "sgrep"
brew "staticcheck"
brew "step"
brew "stylua"
brew "subversion"
brew "tealdeer"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thrift@0.9", link: true
brew "tmux"
brew "tree"
brew "uv"
brew "vcpkg"
brew "vim"
brew "vips"
brew "w3m"
brew "watch"
brew "watchman"
brew "wget"
brew "wtfutil"
brew "xclip"
brew "xsel"
brew "you-get"
brew "zoxide"
brew "ariga/tap/atlas"
brew "bufbuild/buf/buf"
brew "d12frosted/emacs-plus/emacs-plus@29", link: false
brew "filosottile/musl-cross/musl-cross"
brew "hudochenkov/sshpass/sshpass"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"
brew "osx-cross/avr/avr-gcc@8"
brew "ringohub/redis-cli/redis-cli"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "homebrew/cask-versions/adoptopenjdk8"
cask "alacritty"
cask "android-studio"
cask "another-redis-desktop-manager"
cask "bloomrpc"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "gitup-app"
cask "postman"
cask "sequel-ace"
cask "warp"
cask "wave"
cask "wireshark-app"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "twxs.cmake"
go "github.com/bufbuild/buf-language-server/cmd/bufls"
go "github.com/sjzar/chatlog"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/go-delve/delve/cmd/dlv"
go "entgo.io/ent/cmd/ent"
go "ergo.tools/ergo"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "mvdan.cc/garble"
go "golang.org/dl/go1.18.10"
go "golang.org/dl/go1.21.5"
go "golang.org/dl/go1.21.6"
go "golang.org/dl/go1.21.9"
go "github.com/mdempsky/gocode"
go "github.com/zeromicro/go-zero/tools/goctl"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/godoc"
go "github.com/godoctor/godoctor"
go "mvdan.cc/gofumpt"
go "github.com/zmb3/gogetdoc"
go "golang.org/x/tools/cmd/goimports"
go "github.com/incu6us/goimports-reviser/v3"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/nametake/golangci-lint-langserver"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/cmd/gonew"
go "github.com/control-theory/gonzo/cmd/gonzo"
go "github.com/haya14busa/gopkgs/cmd/gopkgs"
go "golang.org/x/tools/gopls"
go "github.com/google/gops"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "honnef.co/go/gotraceui/cmd/gotraceui"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/segmentio/ksuid/cmd/ksuid"
go "github.com/vektra/mockery/v2"
go "github.com/golang/mock/mockgen"
go "github.com/google/pprof"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "github.com/hashicorp/protoc-gen-go-binary"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/gogo/protobuf/protoc-gen-gogoslick"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/favadi/protoc-go-inject-tag"
go "github.com/sqls-server/sqls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/golangci/golangci-lint/v2/cmd/xena-lint"
go "gitlab-vywrajy.micoworld.net/xparty-back/xena-base/tools/xena-new"
uv "specify-cli"
