tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "jimbojsb/launchrocket"
tap "mongodb/brew"
tap "phinze/cask"
tap "pote/gpm_plugins"
brew "ack"
brew "ant"
brew "apache-spark"
brew "appledoc"
brew "openssl@1.1"
brew "readline"
brew "autoconf"
brew "automake"
brew "libffi"
brew "carthage"
brew "ccat"
brew "cmake"
brew "metis"
brew "openssl"
brew "cheat"
brew "chromedriver"
brew "clang-format"
brew "cloog"
brew "cmatrix"
brew "convmv"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "dep"
brew "docker-machine-driver-xhyve"
brew "elasticsearch", restart_service: true
brew "elasticsearch@5.6"
brew "emacs"
brew "epstool"
brew "erlang"
brew "faac"
brew "faad2"
brew "giflib"
brew "ffmpeg"
brew "fig2dev"
brew "fish"
brew "fzf"
brew "gd"
brew "gdb"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gl2ps"
brew "glances"
brew "glpk"
brew "gnu-sed"
brew "qt", link: true
brew "gnuplot"
brew "gpm"
brew "gradle"
brew "libtool"
brew "graphicsmagick"
brew "graphviz"
brew "guetzli"
brew "hbase"
brew "hdf5"
brew "ncurses"
brew "htop"
brew "http_load"
brew "httpie"
brew "mcpp"
brew "ice"
brew "libxml2"
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "iftop"
brew "imagemagick"
brew "ios-deploy"
brew "iperf"
brew "ispell"
brew "jemalloc"
brew "zookeeper", restart_service: true
brew "kafka", restart_service: true
brew "kubernetes-cli"
brew "sdl"
brew "libav"
brew "libiconv"
brew "libksba"
brew "libnet"
brew "libnids"
brew "libxslt"
brew "libyaml"
brew "mackup"
brew "makedepend"
brew "markdown"
brew "maven"
brew "md5deep"
brew "memcached", restart_service: true
brew "mercurial"
brew "mono"
brew "mtr"
brew "mysql", restart_service: true
brew "netcat"
brew "nmap"
brew "node"
brew "plotutils"
brew "qhull"
brew "texinfo"
brew "octave"
brew "opencc"
brew "tbb"
brew "opencv"
brew "opencv@2"
brew "postgresql", restart_service: true
brew "protobuf"
brew "proxychains-ng"
brew "pwgen"
brew "pyenv"
brew "qscintilla2"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "sbt"
brew "scalariform"
brew "shadowsocks-libev"
brew "sl"
brew "sox"
brew "sysbench"
brew "tcpkali"
brew "tcptraceroute"
brew "telnet"
brew "terminal-notifier"
brew "texi2html"
brew "the_silver_searcher"
brew "thrift@0.9"
brew "tmux"
brew "tree"
brew "v8"
brew "vegeta"
brew "watch"
brew "watchman"
brew "wget"
brew "xctool"
brew "xhyve", args: ["HEAD"]
brew "yarn"
brew "yasm"
brew "zsh"
brew "coursier/formulas/coursier"
brew "mongodb/brew/mongodb-community"
cask "phinze/cask/anaconda"
cask "phinze/cask/clean-me"
cask "phinze/cask/p4v"
cask "phinze/cask/squirrel"
cask "phinze/cask/xquartz"
