tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "ringohub/redis-cli"
brew "jpeg", link: true
brew "libpng"
brew "jpeg-xl"
brew "aom"
brew "asciidoc"
brew "autoconf"
brew "automake"
brew "glib"
brew "python@3.9"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "fd"
brew "guile"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "gcc"
brew "gdb"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "hugo"
brew "mysql-client"
brew "hydra"
brew "iftop"
brew "shared-mime-info"
brew "libheif"
brew "python@3.8", link: false
brew "imagemagick"
brew "ispell"
brew "jemalloc"
brew "jmeter"
brew "jq"
brew "kind"
brew "lazygit"
brew "libiconv"
brew "libimobiledevice"
brew "libpq", link: true
brew "libvterm"
brew "libxslt"
brew "llvm"
brew "markdown"
brew "maven"
brew "md5deep"
brew "mercurial"
brew "minikube"
brew "mongo-c-driver"
brew "mtr"
brew "nghttp2"
brew "nmap"
brew "node", link: false
brew "pipenv"
brew "pipx"
brew "plantuml"
brew "pngcheck"
brew "pngpaste"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "sgrep"
brew "step"
brew "subversion"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thrift@0.9", link: true
brew "tmux"
brew "tree"
brew "upx"
brew "vim"
brew "vips"
brew "w3m"
brew "watch"
brew "watchman"
brew "wget"
brew "you-get"
brew "zlib"
brew "d12frosted/emacs-plus/emacs-plus@29"
brew "hudochenkov/sshpass/sshpass"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"
brew "osx-cross/avr/avr-gcc@8"
brew "qmk/qmk/qmk"
brew "ringohub/redis-cli/redis-cli"
cask "adoptopenjdk8"
cask "alacritty"
cask "android-studio"
cask "appflowy"
cask "charles"
cask "dash"
cask "dingtalk"
cask "divvy"
cask "font-source-code-pro"
cask "foxmail"
cask "gcc-arm-embedded"
cask "iterm2"
cask "karabiner-elements"
cask "mactex"
cask "postman"
cask "qmk-toolbox"
cask "qq"
cask "qqmusic"
cask "sublime-text"
cask "the-unarchiver"
cask "tunnelblick"
cask "typora"
cask "v2rayu"
cask "wechat"
cask "wireshark"
cask "youdaodict"
